{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hello",
          "Hey",
          "Good day",
          "Is this the trivia bot?",
          "Greetings!"
        ],
        "responses": [
          "Hello there! Ready to test your knowledge with some trivia?",
          "Hi! Let's dive into some trivia fun. What category are you in the mood for?",
          "Hey! How about some trivia to get things started?",
          "Greetings! Which trivia category would you like to explore today?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye", "I'm done", "Talk to you soon"],
        "responses": [
          "Thanks for playing trivia! Hope to see you again soon!",
          "Goodbye! Come back anytime for more trivia challenges!",
          "Take care! Keep those brain cells sharp and see you next time!",
          "See you later! Don't forget to come back for more fun trivia!"
        ]
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That was fun", "Thanks for the trivia"],
        "responses": [
          "You're very welcome! I'm glad you enjoyed it!",
          "Happy to help! Trivia is always fun, isn't it?",
          "Anytime! Feel free to come back for more trivia!",
          "I'm glad you had fun! Let's do it again soon!"
        ]
      },
      {
        "tag": "categories",
        "patterns": [
          "What trivia categories do you have?",
          "Show me the trivia categories",
          "List the trivia categories",
          "What kind of trivia topics are available?"
        ],
        "responses": [
          "We have categories like: History, Science, Sports, Geography, Movies, and Music. Which one do you want to try?",
          "You can choose from: History, Science, Sports, Geography, Movies, or Music. Ready to test your knowledge?",
          "Our categories include: History, Science, Sports, Geography, Movies, and Music. Pick one and let's play!",
          "The trivia categories available are: History, Science, Sports, Geography, Movies, and Music. What's your choice?"
        ]
      },
      {
        "tag": "history_trivia",
        "patterns": [
          "Give me a history trivia question",
          "I want to try history trivia",
          "Ask me a history question",
          "Let's do some history trivia"
        ],
        "responses": [
          "Here's a history question: Who was the first President of the United States?",
          "History time! In which year did World War I begin?",
          "Time for a history challenge: Who was the first woman to win a Nobel Prize?",
          "Let's test your history knowledge: Which empire built the Colosseum in Rome?"
        ],
        "answers": [
          "George Washington",
          "1914",
          "Marie Curie",
          "Roman Empire"
        ]
      },
      {
        "tag": "science_trivia",
        "patterns": [
          "Give me a science trivia question",
          "I want to try science trivia",
          "Ask me a science question",
          "Let's do some science trivia"
        ],
        "responses": [
          "Here’s a science question: What is the chemical symbol for water?",
          "Let's see if you're a science buff: What planet is known as the Red Planet?",
          "Science time! Who developed the theory of general relativity?",
          "Test your science knowledge: What is the most abundant gas in Earth's atmosphere?"
        ],
        "answers": [
          "H2O",
          "Mars",
          "Albert Einstein",
          "Nitrogen"
        ]
      },
      {
        "tag": "sports_trivia",
        "patterns": [
          "Give me a sports trivia question",
          "I want to try sports trivia",
          "Ask me a sports question",
          "Let's do some sports trivia"
        ],
        "responses": [
          "Here's a sports question: Which country won the FIFA World Cup in 2018?",
          "Sports trivia coming your way: How many players are there in a standard soccer team?",
          "Let's see if you're a sports expert: Who holds the record for the most Olympic gold medals?",
          "Here's a sports challenge: In which sport would you perform a 'slam dunk'?"
        ],
        "answers": [
          "France",
          "11",
          "Michael Phelps",
          "Basketball"
        ]
      },
      {
        "tag": "geography_trivia",
        "patterns": [
          "Give me a geography trivia question",
          "I want to try geography trivia",
          "Ask me a geography question",
          "Let's do some geography trivia"
        ],
        "responses": [
          "Geography time! What is the capital city of Japan?",
          "Test your geography skills: Which country has the longest coastline?",
          "Let's challenge your geography knowledge: What is the largest desert in the world?",
          "Here’s a geography question: Which river flows through the Amazon Rainforest?"
        ],
        "answers": [
          "Tokyo",
          "Canada",
          "Antarctica",
          "Amazon River"
        ]
      },
      {
        "tag": "movies_trivia",
        "patterns": [
          "Give me a movie trivia question",
          "I want to try movie trivia",
          "Ask me a movie question",
          "Let's do some movie trivia"
        ],
        "responses": [
          "Here's a movie question: Who directed the movie 'Inception'?",
          "Let's see if you're a movie buff: In what year was the first Star Wars movie released?",
          "Movies trivia time! What is the highest-grossing movie of all time?",
          "Challenge your movie knowledge: Which movie features a character named Jack Dawson?"
        ],
        "answers": [
          "Christopher Nolan",
          "1977",
          "Avatar",
          "Titanic"
        ]
      },
      {
        "tag": "music_trivia",
        "patterns": [
          "Give me a music trivia question",
          "I want to try music trivia",
          "Ask me a music question",
          "Let's do some music trivia"
        ],
        "responses": [
          "Here's a music question: Who is known as the King of Pop?",
          "Let's see if you're a music fan: What is the best-selling album of all time?",
          "Music trivia coming your way: Which artist holds the record for the most Grammy awards?",
          "Test your music knowledge: What band was Freddie Mercury the lead singer of?"
        ],
        "answers": [
          "Michael Jackson",
          "Thriller by Michael Jackson",
          "Beyoncé",
          "Queen"
        ]
      }
    ]
  }
  